#### Terraform Validation & Plan Results
* Terraform Version 📎`1.9.6`
* Working Directory 📂`./modules/test`
* Terraform Initialization ⚙️`success`
* Terraform Validation 🤖`success`
* Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
[0m[1mmodule.setup.module.storage_account.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mmodule.setup.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mmodule.setup.module.ai_studio_hub.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mmodule.ai_service.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mmodule.setup.module.storage_account.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD05ZThjYzgyNC0yY2E3LTQwYjYtYmNmOC1hY2Y2NDg3NWQ1OGQ7b2JqZWN0SWQ9OGU5N2I5YTMtNDcxNC00ZWQ0LWIxYTYtNjY2MzhjNWRkOTQwO3N1YnNjcmlwdGlvbklkPTFmZGFiMTE4LTE2MzgtNDE5YS04YjEyLTA2Yzk1NDM3MTRhMDt0ZW5hbnRJZD0zNzk2M2RkNC1mNGU2LTQwZjgtYTdkNi0yNGI5NzkxOWU0NTI=][0m
[0m[1mmodule.ai_studio_project.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mmodule.setup.module.key_vault.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mmodule.setup.module.container_registry.azurerm_container_registry.container_registry: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tfmodule-test-rg/providers/Microsoft.ContainerRegistry/registries/mbprj004intacr001][0m
[0m[1mmodule.ai_service.azurerm_cognitive_account.cognitive_account: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tfmodule-test-rg/providers/Microsoft.CognitiveServices/accounts/mbprj002-aoai001][0m
[0m[1mmodule.setup.module.application_insights.azurerm_application_insights.application_insights: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tfmodule-test-rg/providers/Microsoft.Insights/components/mbprj004-int-ai001][0m
[0m[1mmodule.setup.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD05ZThjYzgyNC0yY2E3LTQwYjYtYmNmOC1hY2Y2NDg3NWQ1OGQ7b2JqZWN0SWQ9OGU5N2I5YTMtNDcxNC00ZWQ0LWIxYTYtNjY2MzhjNWRkOTQwO3N1YnNjcmlwdGlvbklkPTFmZGFiMTE4LTE2MzgtNDE5YS04YjEyLTA2Yzk1NDM3MTRhMDt0ZW5hbnRJZD0zNzk2M2RkNC1mNGU2LTQwZjgtYTdkNi0yNGI5NzkxOWU0NTI=][0m
[0m[1mmodule.setup.module.ai_studio_hub.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD05ZThjYzgyNC0yY2E3LTQwYjYtYmNmOC1hY2Y2NDg3NWQ1OGQ7b2JqZWN0SWQ9OGU5N2I5YTMtNDcxNC00ZWQ0LWIxYTYtNjY2MzhjNWRkOTQwO3N1YnNjcmlwdGlvbklkPTFmZGFiMTE4LTE2MzgtNDE5YS04YjEyLTA2Yzk1NDM3MTRhMDt0ZW5hbnRJZD0zNzk2M2RkNC1mNGU2LTQwZjgtYTdkNi0yNGI5NzkxOWU0NTI=][0m
[0m[1mmodule.setup.module.key_vault.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD05ZThjYzgyNC0yY2E3LTQwYjYtYmNmOC1hY2Y2NDg3NWQ1OGQ7b2JqZWN0SWQ9OGU5N2I5YTMtNDcxNC00ZWQ0LWIxYTYtNjY2MzhjNWRkOTQwO3N1YnNjcmlwdGlvbklkPTFmZGFiMTE4LTE2MzgtNDE5YS04YjEyLTA2Yzk1NDM3MTRhMDt0ZW5hbnRJZD0zNzk2M2RkNC1mNGU2LTQwZjgtYTdkNi0yNGI5NzkxOWU0NTI=][0m
[0m[1mmodule.ai_studio_project.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD05ZThjYzgyNC0yY2E3LTQwYjYtYmNmOC1hY2Y2NDg3NWQ1OGQ7b2JqZWN0SWQ9OGU5N2I5YTMtNDcxNC00ZWQ0LWIxYTYtNjY2MzhjNWRkOTQwO3N1YnNjcmlwdGlvbklkPTFmZGFiMTE4LTE2MzgtNDE5YS04YjEyLTA2Yzk1NDM3MTRhMDt0ZW5hbnRJZD0zNzk2M2RkNC1mNGU2LTQwZjgtYTdkNi0yNGI5NzkxOWU0NTI=][0m
[0m[1mmodule.ai_service.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD05ZThjYzgyNC0yY2E3LTQwYjYtYmNmOC1hY2Y2NDg3NWQ1OGQ7b2JqZWN0SWQ9OGU5N2I5YTMtNDcxNC00ZWQ0LWIxYTYtNjY2MzhjNWRkOTQwO3N1YnNjcmlwdGlvbklkPTFmZGFiMTE4LTE2MzgtNDE5YS04YjEyLTA2Yzk1NDM3MTRhMDt0ZW5hbnRJZD0zNzk2M2RkNC1mNGU2LTQwZjgtYTdkNi0yNGI5NzkxOWU0NTI=][0m
[0m[1mmodule.setup.module.key_vault.azurerm_key_vault.key_vault: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tfmodule-test-rg/providers/Microsoft.KeyVault/vaults/mbprj004-int-kv001][0m
[0m[1mmodule.setup.module.storage_account.azurerm_storage_account.storage_account: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tfmodule-test-rg/providers/Microsoft.Storage/storageAccounts/mbprj004intstg001][0m
[0m[1mmodule.ai_service.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_cognitive_account: Reading...[0m[0m
[0m[1mmodule.ai_service.azurerm_private_endpoint.private_endpoint_cognitive_account: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tfmodule-test-rg/providers/Microsoft.Network/privateEndpoints/mbprj002-aoai001-account-pe][0m
[0m[1mmodule.setup.module.container_registry.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_container_registry: Reading...[0m[0m
[0m[1mmodule.setup.module.container_registry.azurerm_private_endpoint.container_registry_private_endpoint: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tfmodule-test-rg/providers/Microsoft.Network/privateEndpoints/mbprj004intacr001-registry-pe][0m
[0m[1mmodule.ai_service.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_cognitive_account: Read complete after 0s [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tfmodule-test-rg/providers/Microsoft.CognitiveServices/accounts/mbprj002-aoai001][0m
[0m[1mmodule.setup.module.key_vault.azurerm_role_assignment.current_roleassignment_key_vault: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tfmodule-test-rg/providers/Microsoft.KeyVault/vaults/mbprj004-int-kv001/providers/Microsoft.Authorization/roleAssignments/8be5c2f9-717e-4b7c-58fa-92cfed980888][0m
[0m[1mmodule.setup.module.key_vault.azurerm_private_endpoint.private_endpoint_cognitive_account_vault: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tfmodule-test-rg/providers/Microsoft.Network/privateEndpoints/mbprj004-int-kv001-vault-pe][0m
[0m[1mmodule.setup.module.container_registry.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_container_registry: Read complete after 1s [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tfmodule-test-rg/providers/Microsoft.ContainerRegistry/registries/mbprj004intacr001][0m
[0m[1mmodule.setup.module.application_insights.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_application_insights: Reading...[0m[0m
[0m[1mmodule.setup.module.application_insights.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_application_insights: Read complete after 0s [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tfmodule-test-rg/providers/Microsoft.Insights/components/mbprj004-int-ai001][0m
[0m[1mmodule.ai_service.time_sleep.sleep_connectivity: Refreshing state... [id=2024-10-17T09:25:32Z][0m
[0m[1mmodule.setup.module.container_registry.time_sleep.sleep_connectivity: Refreshing state... [id=2024-10-08T12:13:53Z][0m
[0m[1mmodule.setup.module.key_vault.time_sleep.sleep_connectivity: Refreshing state... [id=2024-10-08T12:13:47Z][0m
[0m[1mmodule.setup.module.storage_account.azurerm_role_assignment.current_roleassignment_storage_blob_data_owner: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tfmodule-test-rg/providers/Microsoft.Storage/storageAccounts/mbprj004intstg001/providers/Microsoft.Authorization/roleAssignments/f0e217d2-d684-1295-9aab-3e510c96fc37][0m
[0m[1mmodule.setup.module.storage_account.azurerm_private_endpoint.private_endpoint_storage_account["blob"]: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tfmodule-test-rg/providers/Microsoft.Network/privateEndpoints/mbprj004intstg001-blob-pe][0m
[0m[1mmodule.setup.module.storage_account.azurerm_private_endpoint.private_endpoint_storage_account["table"]: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tfmodule-test-rg/providers/Microsoft.Network/privateEndpoints/mbprj004intstg001-table-pe][0m
[0m[1mmodule.setup.module.ai_studio_hub.azapi_resource.ai_studio_hub: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tfmodule-test-rg/providers/Microsoft.MachineLearningServices/workspaces/mbprj004-int-aih010][0m
[0m[1mmodule.setup.module.storage_account.azurerm_private_endpoint.private_endpoint_storage_account["file"]: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tfmodule-test-rg/providers/Microsoft.Network/privateEndpoints/mbprj004intstg001-file-pe][0m
[0m[1mmodule.setup.module.storage_account.azurerm_private_endpoint.private_endpoint_storage_account["queue"]: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tfmodule-test-rg/providers/Microsoft.Network/privateEndpoints/mbprj004intstg001-queue-pe][0m
[0m[1mmodule.ai_studio_project.azapi_resource.ai_studio_project: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tfmodule-test-rg/providers/Microsoft.MachineLearningServices/workspaces/mbprj004][0m
[0m[1mmodule.setup.module.ai_studio_hub.azurerm_private_endpoint.private_endpoint_ai_studio_hub: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tfmodule-test-rg/providers/Microsoft.Network/privateEndpoints/mbprj004-int-aih010-amlworkspace-pe][0m
[0m[1mmodule.ai_studio_hub_outbound_rules.azapi_resource_action.ai_studio_hub_outbound_rules: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tfmodule-test-rg/providers/Microsoft.MachineLearningServices/workspaces/mbprj004-int-aih010][0m
[0m[1mmodule.ai_studio_hub_outbound_rules.azapi_resource_action.ai_studio_hub_provision_managed_network[0]: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tfmodule-test-rg/providers/Microsoft.MachineLearningServices/workspaces/mbprj004-int-aih010/provisionManagedNetwork][0m
[0m[1mmodule.ai_studio_hub_outbound_rules.null_resource.ai_studio_hub_private_endpoints_approval["aoai"]: Refreshing state... [id=1421094748828527752][0m
[0m[1mmodule.ai_studio_hub_outbound_rules.null_resource.ai_studio_hub_private_endpoints_approval["default-storage-queue"]: Refreshing state... [id=3168487175720792952][0m
[0m[1mmodule.ai_studio_hub_outbound_rules.null_resource.ai_studio_hub_private_endpoints_approval["default-storage-table"]: Refreshing state... [id=3462423531738836556][0m
[0m[1mmodule.setup.module.storage_account.time_sleep.sleep_connectivity: Refreshing state... [id=2024-10-08T12:14:18Z][0m
[0m[1mmodule.ai_studio_project.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_ai_studio_project: Reading...[0m[0m
[0m[1mmodule.ai_studio_project.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_ai_studio_project: Read complete after 0s [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tfmodule-test-rg/providers/Microsoft.MachineLearningServices/workspaces/mbprj004][0m
[0m[1mmodule.setup.module.ai_studio_hub.time_sleep.sleep_connectivity: Refreshing state... [id=2024-10-08T17:04:28Z][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [33m~[0m update in-place[0m
 [36m<=[0m read (data resources)[0m

Terraform will perform the following actions:

[1m  # module.setup.module.ai_studio_hub.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_ai_studio_hub[0m will be read during apply
  # (depends on a resource or a module with changes pending)
[0m [36m<=[0m[0m data "azurerm_monitor_diagnostic_categories" "diagnostic_categories_ai_studio_hub" {
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m log_category_groups = (known after apply)
      [32m+[0m[0m log_category_types  = (known after apply)
      [32m+[0m[0m metrics             = (known after apply)
      [32m+[0m[0m resource_id         = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tfmodule-test-rg/providers/Microsoft.MachineLearningServices/workspaces/mbprj004-int-aih010"
    }

[1m  # module.setup.module.ai_studio_hub.azapi_resource.ai_studio_hub[0m will be updated in-place
[0m  [33m~[0m[0m resource "azapi_resource" "ai_studio_hub" {
      [33m~[0m[0m body                      = {
          [33m~[0m[0m properties = {
              [33m~[0m[0m publicNetworkAccess             = "Enabled" [33m->[0m[0m "Disabled"
                [90m# (18 unchanged attributes hidden)[0m[0m
            }
            [90m# (2 unchanged attributes hidden)[0m[0m
        }
        id                        = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tfmodule-test-rg/providers/Microsoft.MachineLearningServices/workspaces/mbprj004-int-aih010"
        name                      = "mbprj004-int-aih010"
      [33m~[0m[0m output                    = {} -> (known after apply)
        tags                      = {
            "test" = "aistudioproject"
        }
        [90m# (8 unchanged attributes hidden)[0m[0m

        [90m# (1 unchanged block hidden)[0m[0m
    }

[1m  # module.setup.module.ai_studio_hub.azurerm_private_endpoint.private_endpoint_ai_studio_hub[0m will be updated in-place
[0m  [33m~[0m[0m resource "azurerm_private_endpoint" "private_endpoint_ai_studio_hub" {
        id                            = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tfmodule-test-rg/providers/Microsoft.Network/privateEndpoints/mbprj004-int-aih010-amlworkspace-pe"
        name                          = "mbprj004-int-aih010-amlworkspace-pe"
      [33m~[0m[0m tags                          = {
          [32m+[0m[0m "test" = "aistudioproject"
        }
        [90m# (7 unchanged attributes hidden)[0m[0m

        [90m# (2 unchanged blocks hidden)[0m[0m
    }

[1m  # module.setup.module.key_vault.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_key_vault[0m will be read during apply
  # (depends on a resource or a module with changes pending)
[0m [36m<=[0m[0m data "azurerm_monitor_diagnostic_categories" "diagnostic_categories_key_vault" {
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m log_category_groups = (known after apply)
      [32m+[0m[0m log_category_types  = (known after apply)
      [32m+[0m[0m metrics             = (known after apply)
      [32m+[0m[0m resource_id         = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tfmodule-test-rg/providers/Microsoft.KeyVault/vaults/mbprj004-int-kv001"
    }

[1m  # module.setup.module.key_vault.azurerm_key_vault.key_vault[0m will be updated in-place
[0m  [33m~[0m[0m resource "azurerm_key_vault" "key_vault" {
      [33m~[0m[0m access_policy                   = [
          [31m-[0m[0m {
              [31m-[0m[0m certificate_permissions = [
                  [31m-[0m[0m "all",
                ]
              [31m-[0m[0m key_permissions         = [
                  [31m-[0m[0m "all",
                ]
              [31m-[0m[0m object_id               = "4fdb36d0-ecd7-4433-96ae-06110965fee8"
              [31m-[0m[0m secret_permissions      = [
                  [31m-[0m[0m "all",
                ]
              [31m-[0m[0m storage_permissions     = []
              [31m-[0m[0m tenant_id               = "37963dd4-f4e6-40f8-a7d6-24b97919e452"
                [90m# (1 unchanged attribute hidden)[0m[0m
            },
        ]
        id                              = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tfmodule-test-rg/providers/Microsoft.KeyVault/vaults/mbprj004-int-kv001"
        name                            = "mbprj004-int-kv001"
        tags                            = {
            "test" = "aistudioproject"
        }
        [90m# (12 unchanged attributes hidden)[0m[0m

        [90m# (1 unchanged block hidden)[0m[0m
    }

[1m  # module.setup.module.storage_account.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_storage_account[0m will be read during apply
  # (depends on a resource or a module with changes pending)
[0m [36m<=[0m[0m data "azurerm_monitor_diagnostic_categories" "diagnostic_categories_storage_account" {
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m log_category_groups = (known after apply)
      [32m+[0m[0m log_category_types  = (known after apply)
      [32m+[0m[0m metrics             = (known after apply)
      [32m+[0m[0m resource_id         = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tfmodule-test-rg/providers/Microsoft.Storage/storageAccounts/mbprj004intstg001"
    }

[1m  # module.setup.module.storage_account.azurerm_storage_account.storage_account[0m will be updated in-place
[0m  [33m~[0m[0m resource "azurerm_storage_account" "storage_account" {
        id                                 = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tfmodule-test-rg/providers/Microsoft.Storage/storageAccounts/mbprj004intstg001"
      [33m~[0m[0m local_user_enabled                 = false [33m->[0m[0m true
        name                               = "mbprj004intstg001"
      [33m~[0m[0m shared_access_key_enabled          = false [33m->[0m[0m true
        tags                               = {
            "test" = "aistudioproject"
        }
        [90m# (94 unchanged attributes hidden)[0m[0m

      [33m~[0m[0m network_rules {
            [90m# (4 unchanged attributes hidden)[0m[0m

          [33m~[0m[0m private_link_access {
              [33m~[0m[0m endpoint_resource_id = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourcegroups/*/providers/Microsoft.MachineLearningServices/registries/*" [33m->[0m[0m "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/providers/Microsoft.Security/datascanners/StorageDataScanner"
                [90m# (1 unchanged attribute hidden)[0m[0m
            }
          [33m~[0m[0m private_link_access {
              [33m~[0m[0m endpoint_resource_id = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourcegroups/*/providers/Microsoft.MachineLearningServices/workspaces/*" [33m->[0m[0m "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourcegroups/*/providers/Microsoft.MachineLearningServices/registries/*"
                [90m# (1 unchanged attribute hidden)[0m[0m
            }
          [33m~[0m[0m private_link_access {
              [33m~[0m[0m endpoint_resource_id = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/providers/Microsoft.Security/datascanners/StorageDataScanner" [33m->[0m[0m "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourcegroups/*/providers/Microsoft.MachineLearningServices/workspaces/*"
                [90m# (1 unchanged attribute hidden)[0m[0m
            }
        }

        [90m# (5 unchanged blocks hidden)[0m[0m
    }

[1mPlan:[0m 0 to add, 4 to change, 0 to destroy.
[0m[90m
─────────────────────────────────────────────────────────────────────────────[0m

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>